const SamanStates = {
  OK: { code: 0, cause: 'تراکنش با موفقیت انجام شد', response: 'عملیات موفق' },
  'Canceled By User': { code: -1, cause: 'تراکنش توسط کاربر لغو شد', response: 'عملیات ناموفق' },
  'Canceled By Issuer': { code: -1, cause: 'صادرکننده از انجام تراکنش صرف نظر کرد', response: 'عملیات ناموفق' },
  'Invalid Merchant': {
    code: 3,
    cause: 'پذیرنده فروشگاهی نامعتبر است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Do Not Honour': {
    code: 5,
    cause: 'از انجام تراکنش صرف نظر شد',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Honour With Identification': {
    code: 8,
    cause: 'با تشخیص هویت دارنده کارت، تراکنش موفق می‌باشد',
    response: 'عملیات موفق',
  },
  'Invalid Transaction': {
    code: 12,
    cause: 'تراکنش نامعتبر است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Invalid Card Number': {
    code: 14,
    cause: 'شماره کارت ارسالی نامعتبر است (وجود ندارد)',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'No Such Issuer': { code: 15, cause: 'چنین صادر کننده کارتی وجود ندارد', response: 'کارت نامعتبر است' },
  'Approved Update Track3': {
    code: 16,
    cause: 'تراکنش مورد تایید است و اطلاعات شیار سوم کارت به روز رسانی شود',
    response: 'عملیات موفق',
  },
  'Reenter Transaction': { code: 19, cause: 'تراکنش مجددا ارسال شود', response: 'عملیات ناموفق' },
  'UnAcceptable Transaction Fee': {
    code: 23,
    cause: 'کارمزد ارسالی پذیرنده غیر قابل قبول است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Format Error': {
    code: 30,
    cause: 'قالب پیام دارای اشکال است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Bank Not Supported By Switch': {
    code: 31,
    cause: 'پذیرنده توسط سوییچ پشتیبانی نمی‌شود',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Expired Card Pick Up': {
    code: 33,
    cause: 'از تاریخ انقضای کارت گذشته است و کارت دیگر معتبر نیست',
    response: 'کارت نامعتبر است (تاریخ انقضای کارت سپری شده است)',
  },
  'Suspected Fraud Pick Up': {
    code: 34,
    cause: 'خریدار یا فیلد CVV2 و یا فیلد ExpDate را اشتباه وارد کرده است (یا دارنده کارت مظنون به تقلب است)',
    response: 'عملیات ناموفق',
  },
  'Allowable PIN Tries Exceeded Pick Up': {
    code: 38,
    cause: 'تعداد دفعات ورود رمز غلط بیش از حد مجاز است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'No Credit Acount': { code: 39, cause: 'کارت حساب اعتباری ندارد', response: 'کارت نامعتبر است' },
  'Requested Function': { code: 40, cause: 'عملیات درخواستی پشتیبانی نمی‌گردد', response: 'عملیات ناموفق' },
  'Lost Card': { code: 41, cause: 'کارت مفقودی می‌باشد', response: 'کارت نامعتبر است' },
  'No Universal Account': { code: 42, cause: 'کارت حساب عمومی ندارد', response: 'کارت نامعتبر است' },
  'Stolen Card': { code: 43, cause: 'کارت مسروقه می‌باشد', response: 'عملیات ناموفق' },
  'No Investment Acount': { code: 44, cause: 'کارت حساب سرمایه گذاری ندارد', response: 'کارت نامعتبر است' },
  'No Sufficient Funds': { code: 51, cause: 'موجودی کافی نیست', response: 'عدم موجودی کافی' },
  'No Cheque Account': { code: 52, cause: 'کارت حساب جاری ندارد', response: 'کارت نامعتبر است' },
  'No Saving Account': { code: 53, cause: 'کارت حساب قرض الحسنه ندارد', response: 'کارت نامعتبر است' },
  'Expired Account': {
    code: 54,
    cause: 'تاریخ انقضای کارت سپری شده است',
    response: 'کارت نامعتبر است (تاریخ انقضای کارت سپری شده است)',
  },
  'Incorrect PIN': { code: 55, cause: 'خریدار رمز کارت (PIN) را اشتباه وارد کرده است', response: 'رمز نامعتبر است' },
  'No Card Record': { code: 56, cause: 'کارت نامعتبر است', response: 'کارت نامعتبر است' },
  'Transaction Not Permitted To CardHolder': {
    code: 57,
    cause: 'انجام تراکنش مربوطه توسط دارنده کارت مجاز نمی‌باشد',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Transaction Not Permitted To Terminal': {
    code: 58,
    cause: 'انجام تراکنش مربوطه توسط پایانه انجام دهنده مجاز نمی‌باشد',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Exceeds Withdrawal Amount Limit': {
    code: 61,
    cause: 'مبلغ تراکنش بیش از حد مجاز است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Restricted Card-Decline': {
    code: 62,
    cause: 'کارت محدود شده است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Security Violation': { code: 63, cause: 'تمهیدات امنیتی نقض گردیده است', response: 'عملیات ناموفق' },
  'Exceeds Withdrawal Frequency Limit': {
    code: 65,
    cause: 'تعداد درخواست تراکنش بیش از حد مجاز است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Response Received Too Late': { code: 68, cause: 'تراکنش در شبکه بانکی Timeout خورده است', response: '-' },
  'PIN Reties Exceeds-Slm': {
    code: 75,
    cause: 'تعداد دفعات ورود رمز غلط بیش از حد مجاز است',
    response:
      'تراکنش نامعتبر است "در صورت کسر وجه از حساب شما، مبلغ مذکور طی 72 ساعت به حساب شما عودت داده خواهد شد، در غیر این صورت جهت پیگیری لطفا با شماره تلفن 84080-021 تماس حاصل نمایید"',
  },
  'Invalid Amount': { code: 79, cause: 'مبلغ سند برگشتی، از مبلغ تراکنش اصلی بیشتر است', response: 'عملیات ناموفق' },
  'Issuer Down Slm': {
    code: 84,
    cause: 'سیستم بانک صادر کننده کارت خریدار، در وضعیت عملیاتی نیست',
    response: 'عملیات ناموفق',
  },
  'Cut Off Is Inprogress': {
    code: 90,
    cause: 'سامانه مقصد تراکنش در حال انجام عملیات پایان روز می‌باشد',
    response: 'عملیات ناموفق (سامانه مقصد تراکنش در حال انجام عملیات پایان روز میباشد)',
  },
  'Transaction Cannot Be Completed': {
    code: 93,
    cause: 'تراکنش Authorize شده است (شماره PIN و PAN درست هستند) ولی امکان سند خوردن وجود ندارد',
    response: 'عملیات ناموفق',
  },
  'TME Error': { code: 96, cause: 'کلیه خطاهای دیگر بانکی باعث ایجاد چنین خطایی می‌گردد', response: 'عملیات ناموفق' },
  ExceedsWithdrawalAmountLimit: { code: -10, cause: 'تراکنش نامعتبر است' },
};

export = SamanStates;
